{
  "Blue Apron": {
    "Chrissy Teigen's Garlic & Soy-Glazed Shrimp": {
      "name": "Chrissy Teigen's Garlic & Soy-Glazed Shrimp",
      "mealkit": "Blue Apron",
      "steps": [
        "10 oz Shrimp",
        "½ cup Jasmine Rice",
        "1/2 lb Broccoli",
        "1 Jalapeño Pepper",
        "1 Lime",
        "3 cloves Garlic",
        "1 Tbsp Soy Sauce",
        "1 Bird's Eye Chile Pepper",
        "1 Tbsp Light Brown Sugar",
        "2 Tbsps Vegetarian Worcestershire Sauce",
        "1/4 tsp Crushed Red Pepper Flakes",
        "¼ cup Panko Breadcrumbs",
        "2 Tbsps Vegetable Demi-Glace",
        "Wash and dry the fresh produce",
        "Peel and finely chop the garlic",
        "Zest the lime to get 2 teaspoons (if you don’t have a zester, use a peeler to remove the green rind, avoiding the white pith; mince the rind)",
        "Quarter the lime",
        "Cut off and discard the bottom 1/2 inch of the broccoli stem; cut the broccoli into small florets",
        "Cut out and discard the stem, ribs, and seeds of the jalapeño pepper, then small dice",
        "Cut off and discard the stem of the bird’s eye chile; thinly slice crosswise",
        "Thoroughly wash your hands immediately after handling the peppers",
        "In a small pot, heat 2 teaspoons of olive oil on medium-high until hot",
        "Add the diced jalapeño pepper, sliced bird’s eye chile, and 1/3 of the chopped garlic; season with salt and pepper",
        "Cook, stirring frequently, 1 to 2 minutes, or until slightly softened",
        "Add the sugar, Worcestershire sauce, and 2 tablespoons of water (carefully, as the liquid may splatter)",
        "Cook, stirring frequently, 2 to 3 minutes, or until the peppers are softened and the sugar has dissolved",
        "Turn off the heat; stir in the lime zest and the juice of 2 lime wedges",
        "Transfer to a bowl",
        "Rinse and wipe out the pot",
        "In the same pot, combine the rice, a big pinch of salt, and 1 cup of water; heat to boiling on high",
        "Once boiling, reduce the heat to low",
        "Cover and cook, without stirring, 12 to 14 minutes, or until the water has been absorbed and the rice is tender",
        "Turn off the heat and fluff with a fork",
        "Cover to keep warm",
        "While the rice cooks, in a large pan (nonstick, if you have one), heat 1 teaspoon of olive oil on medium-high until hot",
        "Add the breadcrumbs; season with salt and pepper",
        "Cook, stirring frequently, 2 to 3 minutes, or until lightly browned",
        "Transfer to a plate",
        "Wipe out the pan",
        "While the rice continues to cook, in the same pan, heat 2 teaspoons of olive oil on medium-high until hot",
        "Add the broccoli florets in an even layer; season with salt and pepper",
        "Cook, without stirring, 4 to 5 minutes, or until lightly browned and slightly softened",
        "Add half the remaining chopped garlic and as much of the red pepper flakes as you’d like, depending on how spicy you’d like the dish to be",
        "Cook, stirring frequently, 30 seconds to 1 minute, or until fragrant",
        "Add the demi-glace and 1/3 cup of water (carefully, as the liquid may splatter)",
        "Loosely cover the pan with aluminum foil and cook, stirring occasionally, 4 to 5 minutes, or until the broccoli is softened and the liquid has cooked off",
        "Transfer to a large bowl and cover with the aluminum foil to keep warm",
        "Rinse and wipe out the pan",
        "Pat the shrimp dry with paper towels",
        "In the same pan, heat 2 teaspoons of olive oil on medium-high until hot",
        "Add the shrimp in an even layer",
        "Cook, without stirring, 2 to 3 minutes, or until slightly opaque",
        "Add the soy sauce and remaining chopped garlic; cook, stirring frequently, 1 to 2 minutes, or until coated and the shrimp are cooked through",
        "Turn off the heat",
        "Serve the cooked shrimp with the cooked rice and cooked broccoli",
        "Garnish the broccoli with the toasted breadcrumbs",
        "Serve the spicy pepper sauce and remaining lime wedges on the side",
        "Enjoy"
      ],
      "lastIngredient": 12
    },
    "Spicy Penne Pasta with Zucchini & Capers": {
      "name": "Spicy Penne Pasta with Zucchini & Capers",
      "mealkit": "Blue Apron",
      "steps": [
        "1/2 lb Penne Pasta",
        "1 Zucchini",
        "2 cloves Garlic",
        "Heat a medium pot of salted water to boiling on high.",
        "Wash and dry the fresh produce.",
        "Quarter the zucchini lengthwise, then cut crosswise into 1/4-inch- thick pieces."
      ],
      "lastIngredient": 2
    }
  },
  "Purple Carrot": {
    "Creamy Caramelized Onion Burgers with Butter Lettuce Salad": {
      "name": "Creamy Caramelized Onion Burgers with Butter Lettuce Salad",
      "mealkit": "Purple Carrot",
      "steps": [
        "10 oz Ground Beef",
        "2 Potato Buns",
        "1 Sweet Onion",
        "If you’re grilling, preheat your grill to maintain a temperature of 450-500°F.",
        "Oil the grill grates.",
        "Wash and dry the fresh produce."
      ],
      "lastIngredient": 2
    },
    "Spicy Penne Pasta with Zucchini & Capers": {
      "name": "Spicy Penne Pasta with Zucchini & Capers",
      "mealkit": "Purple Carrot",
      "steps": [
        "1/2 lb Penne Pasta",
        "1 Zucchini",
        "2 cloves Garlic",
        "Heat a medium pot of salted water to boiling on high.",
        "Wash and dry the fresh produce.",
        "Quarter the zucchini lengthwise, then cut crosswise into 1/4-inch- thick pieces."
      ],
      "lastIngredient": 2
    }
  }
}
