{
  "Blue Apron": {
    "Chrissy Teigen's Garlic & Soy-Glazed Shrimp": {
      "name": "Chrissy Teigen's Garlic & Soy-Glazed Shrimp",
      "mealkit": "Blue Apron",
      "steps": [
        "10 oz Shrimp.",
        "½ cup Jasmine Rice.",
        "1/2 lb Broccoli.",
        "1 Jalapeño Pepper.",
        "1 Lime.",
        "3 cloves Garlic.",
        "1 Tbsp Soy Sauce.",
        "1 Bird's Eye Chile Pepper.",
        "1 Tbsp Light Brown Sugar.",
        "2 Tbsps Vegetarian Worcestershire Sauce.",
        "1/4 tsp Crushed Red Pepper Flakes.",
        "¼ cup Panko Breadcrumbs.",
        "2 Tbsps Vegetable Demi-Glace.",
        "Wash and dry the fresh produce.",
        "Peel and finely chop the garlic.",
        "Zest the lime to get 2 teaspoons (if you don’t have a zester, use a peeler to remove the green rind, avoiding the white pith; mince the rind).",
        "Quarter the lime.",
        "Cut off and discard the bottom 1/2 inch of the broccoli stem; cut the broccoli into small florets.",
        "Cut out and discard the stem, ribs, and seeds of the jalapeño pepper, then small dice.",
        "Cut off and discard the stem of the bird’s eye chile; thinly slice crosswise.",
        "Thoroughly wash your hands immediately after handling the peppers.",
        "In a small pot, heat 2 teaspoons of olive oil on medium-high until hot.",
        "Add the diced jalapeño pepper, sliced bird’s eye chile, and 1/3 of the chopped garlic; season with salt and pepper.",
        "Cook, stirring frequently, 1 to 2 minutes, or until slightly softened.",
        "Add the sugar, Worcestershire sauce, and 2 tablespoons of water (carefully, as the liquid may splatter).",
        "Cook, stirring frequently, 2 to 3 minutes, or until the peppers are softened and the sugar has dissolved.",
        "Turn off the heat; stir in the lime zest and the juice of 2 lime wedges.",
        "Transfer to a bowl.",
        "Rinse and wipe out the pot.",
        "In the same pot, combine the rice, a big pinch of salt, and 1 cup of water; heat to boiling on high.",
        "Once boiling, reduce the heat to low.",
        "Cover and cook, without stirring, 12 to 14 minutes, or until the water has been absorbed and the rice is tender.",
        "Turn off the heat and fluff with a fork.",
        "Cover to keep warm.",
        "While the rice cooks, in a large pan (nonstick, if you have one), heat 1 teaspoon of olive oil on medium-high until hot.",
        "Add the breadcrumbs; season with salt and pepper.",
        "Cook, stirring frequently, 2 to 3 minutes, or until lightly browned.",
        "Transfer to a plate.",
        "Wipe out the pan.",
        "While the rice continues to cook, in the same pan, heat 2 teaspoons of olive oil on medium-high until hot.",
        "Add the broccoli florets in an even layer; season with salt and pepper.",
        "Cook, without stirring, 4 to 5 minutes, or until lightly browned and slightly softened.",
        "Add half the remaining chopped garlic and as much of the red pepper flakes as you’d like, depending on how spicy you’d like the dish to be.",
        "Cook, stirring frequently, 30 seconds to 1 minute, or until fragrant.",
        "Add the demi-glace and 1/3 cup of water (carefully, as the liquid may splatter).",
        "Loosely cover the pan with aluminum foil and cook, stirring occasionally, 4 to 5 minutes, or until the broccoli is softened and the liquid has cooked off.",
        "Transfer to a large bowl and cover with the aluminum foil to keep warm.",
        "Rinse and wipe out the pan.",
        "Pat the shrimp dry with paper towels.",
        "In the same pan, heat 2 teaspoons of olive oil on medium-high until hot.",
        "Add the shrimp in an even layer.",
        "Cook, without stirring, 2 to 3 minutes, or until slightly opaque.",
        "Add the soy sauce and remaining chopped garlic; cook, stirring frequently, 1 to 2 minutes, or until coated and the shrimp are cooked through.",
        "Turn off the heat.",
        "Serve the cooked shrimp with the cooked rice and cooked broccoli.",
        "Garnish the broccoli with the toasted breadcrumbs.",
        "Serve the spicy pepper sauce and remaining lime wedges on the side.",
        "Enjoy."
      ],
      "lastIngredientIndex": 12,
      "imageURLs": [
        "https://media.blueapron.com/recipes/3116/recipe_steps/29673/1525963948-1-0013-0832/0604_2PF_Garlic-Soy-Shrimp_0006_WEB_high_feature.jpg",
        "https://media.blueapron.com/recipes/3116/recipe_steps/29677/1525963955-1-0008-5084/0604_2PF_Garlic-Soy-Shrimp_0034_WEB_high_feature.jpg",
        "https://media.blueapron.com/recipes/3116/recipe_steps/29674/1525963961-1-0014-6323/0604_2PF_Garlic-Soy-Shrimp_0014_WEB_high_feature.jpg",
        "https://media.blueapron.com/recipes/3116/recipe_steps/29678/1525963968-1-0015-0895/0604_2PF_Garlic-Soy-Shrimp_0055_WEB_high_feature.jpg",
        "https://media.blueapron.com/recipes/3116/recipe_steps/29675/1525963974-1-0009-0310/0604_2PF_Garlic-Soy-Shrimp_0030_WEB_high_feature.jpg",
        "https://media.blueapron.com/recipes/3116/recipe_steps/29676/1525963979-1-0014-4036/0604_2PF_Garlic-Soy-Shrimp_0043_WEB_high_feature.jpg"
      ],
      "imageChangeIndexes": [21, 29, 34, 39, 48]
    },
    "Spicy Penne Pasta": {
      "name": "Spicy Penne Pasta",
      "mealkit": "Blue Apron",
      "steps": [
        "1/2 lb Penne Pasta.",
        "1 Zucchini.",
        "2 cloves Garlic.",
        "Heat a medium pot of salted water to boiling on high.",
        "Wash and dry the fresh produce.",
        "Quarter the zucchini lengthwise, then cut crosswise into 1/4-inch- thick pieces."
      ],
      "lastIngredientIndex": 2
    },
    "Saffron & Yellow Tomato Risotto": {
      "name": "Saffron & Yellow Tomato Risotto",
      "mealkit": "Blue Apron",
      "steps": [
        "1 cup Carnaroli Rice.",
        "1 14-Oz Can Whole Peeled Yellow Tomatoes.",
        "2 cloves Garlic.",
        "1 Zucchini.",
        "1 pinch Saffron.",
        "2 Tbsps Butter.",
        "2 Tbsps Mascarpone Cheese.",
        "1 Shallot.",
        "¼ tsp Crushed Red Pepper Flakes.",
        "1 oz Pecorino Romano Cheese.",
        "1 oz Peruvian Kalamata Olives.",
        "Wash and dry the fresh produce.",
        "Peel and finely chop the shallot.",
        "Peel and roughly chop the garlic.",
        "Halve the zucchini lengthwise; cut crosswise into 1/2-inch-thick pieces.",
        "Using the flat side of your knife, smash the olives; remove and discard the pits, then roughly chop.",
        "Place the tomatoes in a bowl; gently break apart with your hands.",
        "Grate the Pecorino cheese on the small side of a box grater.",
        "In a medium pot, heat 2 teaspoons of olive oil on medium-high until hot.",
        "Add the chopped shallot, half the chopped garlic, and as much of the red pepper flakes as you’d like, depending on how spicy you’d like the dish to be.",
        "Season with salt and pepper.",
        "Cook, stirring frequently, 2 to 3 minutes, or until slightly softened and fragrant.",
        "Add the rice, saffron, tomatoes, and 2 1/4 cups of water (carefully, as the liquid may splatter); heat to boiling on high.",
        "Once boiling, reduce the heat to medium-high.",
        "Cook, stirring occasionally, 15 to 17 minutes, or until most of the liquid is absorbed and the rice is al dente (still slightly firm to the bite).",
        "Turn off the heat.",
        "Add the butter and mascarpone cheese; stir until melted and thoroughly combined.",
        "Season with salt and pepper to taste.",
        "Once the risotto has cooked about 10 minutes, in a medium pan (nonstick, if you have one), heat 2 teaspoons of olive oil on medium-high until hot.",
        "Add the sliced zucchini in an even layer and cook, without stirring, 3 to 4 minutes, or until lightly browned.",
        "Add the remaining chopped garlic; season with salt and pepper.",
        "Cook, stirring constantly, 2 to 3 minutes, or until softened.",
        "Turn off the heat and stir in the chopped olives.",
        "Season with salt and pepper to taste.",
        "Serve the finished risotto topped with the cooked zucchini and grated Pecorino cheese.",
        "Enjoy!."
      ],
      "lastIngredientIndex": 10
    }
  },
  "Purple Carrot": {
    "Buffalo Artichoke Calzone": {
      "name": "Buffalo Artichoke Calzone",
      "mealkit": "Purple Carrot",
      "steps": [
        "1¼ cup flour.",
        "4 oz Lacinato kale.",
        "6 oz grape tomatoes.",
        "1 cucumber.",
        "6 oz artichoke hearts.",
        "2 tbsp vegan butter.",
        "¼ cup hot sauce.",
        "1 tbsp red wine vinegar.",
        "1 packet Dijon mustard.",
        "2 oz spring mix.",
        "¼ cup vegan bleu cheese dressing.",
        "Preheat the oven to 425°F.",
        "Measure out just ¼ cup flour and set it aside.",
        "In a large bowl, add the remaining 1 cup flour, ½ cup cold water, 2 tbsp olive oil, and ¼ tsp salt.",
        "Mix until well combined with a spoon.",
        "Place the dough on a clean workspace.",
        "Knead the dough by pressing it down and folding it repeatedly until it’s a smooth ball.",
        "Wrap the dough in plastic wrap and place in the refrigerator.",
        "Destem the kale and thinly chop the leaves.",
        "Halve the grape tomatoes.",
        "Thinly slice the cucumber into rounds.",
        "Drain and roughly chop the artichoke hearts and dry them with a paper towel.",
        "Place a large nonstick skillet over medium-high heat and add the butter.",
        "Once melted, add the artichoke hearts and cook until crisp in places, about 3 to 4 minutes.",
        "Add the kale and grape tomatoes and cook until the kale is wilted, about 2 to 3 minutes.",
        "Add the hot sauce and stir to combine.",
        "Taste and adjust seasoning with salt and remove from the heat.",
        "Lightly dust a clean workspace with 1 tbsp of the reserved flour.",
        "Roll the dough into a round about an ⅛ inch thick and 12” in diameter, using the flour to keep the dough from sticking (use more flour as necessary).",
        "Spoon the filling onto one side of the dough, 1 inch from the edge.",
        "Fold the dough over to close.",
        "Use a fork or your fingers to press the two sides together at the seam.",
        "Carefully transfer the calzone to a baking sheet with your hands.",
        "Drizzle with 1 tsp olive oil, rubbing it over the top with your fingers or a brush, and cut a few small holes into the dough.",
        "Bake the calzones until the dough is cooked through and is lightly browned on top, about 15 to 18 minutes.",
        "In a large bowl, whisk together the red wine vinegar, Dijon mustard, 1 tbsp olive oil, and a pinch of salt and pepper.",
        "Once the calzone is ready, toss the spring mix (reserving half for the Chickpea Stuffed Avocado recipe) and sliced cucumber with the dressing in the large bowl.",
        "Cut the Buffalo artichoke calzone into slices and serve with and the spring greens salad and bleu cheese dressing on the side."
      ],
      "lastIngredientIndex": 10
    },
    "Mongolian Seitan Lettuce Cups": {
      "name": "Mongolian Seitan Lettuce Cups",
      "mealkit": "Purple Carrot",
      "steps": [
        "¾ cup short grain rice.",
        "1 package seitan.",
        "3 oz celery.",
        "Fresh ginger.",
        "2 cloves garlic.",
        "1 cucumber.",
        "2 Thai chiles.",
        "2 tbsp pine nuts.",
        "2 tbsp tamari.",
        "1 tbsp rice vinegar.",
        "1 packet turbinado sugar.",
        "1 head butter lettuce.",
        "Combine the short grain rice, 1¼ cups of water, and a pinch of salt in a small saucepan and bring to a boil.",
        "Cover, reduce heat to low, and cook until the grains are tender and all water is absorbed, about 15 to 18 minutes.",
        "Thinly slice the seitan.",
        "Thinly slice the celery.",
        "Peel and mince 1 tsp ginger (save any remaining for your own use).",
        "Peel and mince 2 cloves garlic.",
        "Small dice the cucumber.",
        "Thinly slice the Thai chiles.",
        "Place a large nonstick skillet over medium-high heat with 2 tbsp vegetable oil.",
        "Once hot, add the sliced seitan and cook, tossing frequently, until crisp in places, about 4 to 5 minutes.",
        "Add the sliced celery, minced ginger, minced garlic, pine nuts, and as much of the Thai chile as you’d like.",
        "Cook, stirring frequently, until fragrant, about 1 to 2 minutes.",
        "Add the tamari, rice vinegar, turbinado sugar, and ¼ cup water to the skillet.",
        "Toss well to combine, and cook until the sauce is sticky, about 1 minute.",
        "Taste and adjust seasoning with salt.",
        "Separate the butter lettuce leaves, removing any grit from between the leaves.",
        "Fill the lettuce leaves with some sticky rice and top each with the Mongolian seitan and diced cucumbers."
      ],
      "lastIngredientIndex": 11
    },
    "Chickpea Stuffed Avocado": {
      "name": "Chickpea Stuffed Avocado",
      "mealkit": "Purple Carrot",
      "steps": [
        "½ cup red quinoa.",
        "1 scallion.",
        "2 oz celery.",
        "4 oz red grapes.",
        "1 apple.",
        "1 lemon.",
        "1 can chickpeas.",
        "¼ cup Follow Your Heart® Vegenaise®.",
        "1 tsp curry powder.",
        "1 avocado.",
        "4 oz spring mix.",
        "Combine the red quinoa, ¾ cup water, and a pinch of salt in a small saucepan and bring to a boil.",
        "Cover, reduce heat to low, and cook until the water is absorbed and the grains are tender, about 12 to 15 minutes.",
        "Thinly slice the scallion.",
        "Small dice the celery.",
        "Halve the red grapes.",
        "Thinly slice the apple.",
        "Zest and halve the lemon.",
        "Drain and rinse the chickpeas.",
        "Add the chickpeas to a large bowl along with the juice from half the lemon, Vegenaise, curry powder, ¼ tsp salt, and a good pinch of pepper.",
        "Mash some of the chickpeas with the back of a fork and mix well to combine.",
        "Add the scallion, celery, and half the grapes and gently mix them in.",
        "Add the spring mix (reserving half for the Buffalo Artichoke Calzone) to another large bowl and add the cooked red quinoa, sliced apple, lemon zest, juice from the remaining lemon half, 2 tbsp olive oil, and a pinch of salt and pepper.",
        "Toss the quinoa salad well to combine.",
        "Taste and adjust seasoning with salt.",
        "Halve the avocado.",
        "Remove the pit and scoop the flesh out of each half in one piece.",
        "Divide the quinoa salad between plates, and top each with an avocado half.",
        "Stuff the avocado halves with the chickpea salad.",
        "Top with the remaining grapes."
      ],
      "lastIngredientIndex": 10
    }
  }
}
